str = "1. 让文件夹变成python的包：在文件夹中创建文件__init__.py文件\n\
2. 在python2中，只有文件夹中有__init__.py文件，这个文件夹才能\n\
	当做包导入，\n\
	但在python3中不需要\n\
3. 在__init__.py文件中添加__all__变量，作用是：\n\
	在使用 from 包名 import * 时，根据__all__变量选择导入的模块\n\
	但在使用from 包名 import 具体模块名 时，会忽略__all__变量\n\
4. __init__.py文件中的代码，在导入包时会被执行\n\
5. 在__init__.py文件中添加 from . import * ，作用是：\n\
	在 import 包名 时，选择从当前包导入哪些模块"

print("")
print("================================================================================")
print(str)
print("================================================================================")

